Repository: mozilla-l10n/mt-training-data
Catalog: trw/trw_pontoon.tmx
Source language: en_us
Languages: trw

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
trw: تُو ڈیٹا سیٹ <datasetsPage> سی مُو یے </datasetsPage> بش بھادُو۔ ہید ایسی نم ورژن بُو آں کامے جیِب یأ تُو نیِمادُو تھأ بُو۔ بھی ایس ڈائںلوڈ کو۔ ہأ موادا می میٹا ڈیٹا ہودی<metadataLink> یأمنے آبادی سی معلومات آں تصدیق سی ڈیٹا۔ تھے یے پکار تُھو ای میل ایڈریس دے آں بھی اے ڈیٹا ڈائنلوڈ کو۔

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
trw: تُو کامن وائس سی پروفائل سیوادے اے اوپن ڈیٹا سیٹ کے آواز تھل بھادُو۔

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
trw: تُو موزیلا سی جیِبا سی مے کھاما می آمن مے لنک دے <discourseLink>شامل کوبھادُو۔ بات چیت کؤ کیا می </discourseLink>زید کلک کوا یا <matrixLink> جلد ڇھیِڙا سی کیا می زید </matrixLink>کلک کوا۔

source: You cannot add multiple sentences for a single submission
trw: مھو اے ٹک سیت چیر گن جملا نہ تھل بھادی

source: You cannot request your recordings while another request is already in progress.
trw: مھو چھی ریکارڈنگ سی کیا چھی أرضی مُوٹھایے نو کوبھادی کئی کے مُوش ما اے أرضی زید کام ہودُو۔

source: You can request a new takeout of your recordings every { $days } days.
trw: تھو تُنو ریکارڈنگ سی گھیِنُو سی کیا مھیدیک دی یے پأش بھی { $days } أرضی تھل بھادی۔

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
trw: تُو مھال کآں سرگرمی کوبھادُو یرأ تیِن دے خلگ تُنُو دیِشا جملہ دن۔ ہے چھی سوچ ما ہُم سپوگھا تُھو۔ تُو ایس ویڈیو کانفرنس سی شکل دے آن لائن ہُم کوبھادُو۔ تُو ایس خلگا سیت میلدے ہُم کوبھادُو کو کی مسئلہ نُو ہُوو۔ <eventTemplate> مھید مُھن قالب بُوا مھال سرگرمیا سی کیا۔

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
trw: ای می <sentenceCollectorLinkAdd> تُو جملا سی دھأک تعداد جم کوبھادُو۔ </sentenceCollectorLinkAdd> یا گٹ ہب استعمال کیدے چیر گن جم کوبھادُو۔ </bulkImportDocsLink>۔ یاد ساتھ یرأ جملہ خامخا <licenseLink> سی سی 0 یا پبلک ڈومین </licenseLink> لیسن می ہُوئین یا تُو آمنے لیِگ بھادُو۔

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
trw: تُو مے لنک <scraperLink> جملہ جُدا کؤ </scraperLink> سی کیا یا کھیڑینی کؤ سی ویکیپیڈیا استعمال کوبھادُو۔

source: You check whether the transcription matches the audio
trw: چیک کیدے بُودا یرأ کا لیِگُودُودا ہے آڈیو سیت گھڑدُو

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
trw: ویب سائٹ ما دیؤ سأدو تھو ویب سائٹ مے طریقا https://commonvoice.mozilla.org/ دے تھل بھادی۔

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
trw: تھو کتابی حوالہ دیؤ سی طرہقہ مھامُوڑذ یأ ہارورڈ سی، موزیلا 20212021 کام وائس زید یا https://commonvoice.mozilla.org/ مھامُوڑ ویب سائتا سی دے بھادی تی می دی او سن آں ویب سائٹ سی نام لیگیل ہویے۔

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
trw: تُو مے کم سی کیا آں خلگ شیِدؤ سی کیا سوشل میڈیا ہُم استعمال کوبھادُو۔ تُو ایسی بارا می سوشل میڈیا زید پوسٹس شیئر کوبھادُو۔ آں دأل خلگا سیت ہُم شامل ہوبھادُو۔ مھال مسئلہ یرأ سے جیِب سی حغا سی آرٹیفشل انٹیلجنس یا جیِب سی بارا می تعصب سی بارا می ہُم بات کوبھادُو۔ مے پوت زید دیئی ڇھیِڙا بُوا۔ <campaignLink> سوشل میڈیا مہم سی کیا آں مھال مواد سی کیا تیس تُو استعمال کوبھادُو۔ </campaignLink>

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
trw: تأ کی جیِب نے کأری یی۔ تُنُو <profileLink>خاکہ یے بش </profileLink> آں آمن گے جیِب کار۔

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
trw: دُو (مثلاً 2)

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
trw: دُو (مثلاً 2)

source: You have unsaved changes on this page. If you change the locale, your changes will not be saved. Are you sure you want to change the locale?
trw: مے پاݜ می تأ بدلی سیو نی کی یی۔ کو تأ ترجمہ چھئیو مھیدا چھی کوئیل کم جم نہ ہونیِن۔ تُو یقین دے مے ترجمہ سی پاݜ چھودُو کھأ؟

source: You have unsaved changes on this page. If you leave this page, your changes will not be saved. Are you sure you want to leave this page?
trw: مے پاݜ می تأ بدلی سیو نی کی یی۔ کو تأ مے پاݜ چھؤو چھی کوئیل کم جم ہونیِن۔ تھیئے یقین تُھو تُو مے پاݜ زیدا بیَدُو؟

source: You must allow microphone access.
trw: تھے یے مائکروفون چلا۔

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
trw: تھو یے ریکارڈنگ سی ہر ٹیگیل سی بُھویُو تُھو۔ مھو مشین ما نِمادی یرأ ہے بأدا سی دؤران دیر سی شور پیانے، کلہ کلہ پأش کے گن شور ہویے کے یأ تیندے اے لیگیل مواد سی بنُو می گڑبڑ نہ ہوییا۔ پأش کے بھانا سی کیڑ کڑ یا ہال آواز ٹیگیل سی بُھویُو ما دھرادُو۔ ہامُوڑ ہُوو کلپ رد کوا۔

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
trw: چھی لہجہ چھی تلفظ سی طریقہ تُھو۔ ہے کھید تُو دھردُو دا تین دے یأ تُو کامک دأل جیِب بندُودُو تیندے بدل ہویی۔ تُو اے بارا می مناسب معلومات مھید دے بھادُو۔

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
trw: چھی گمنأمی سی ریکاڑد کوئیل آوازے کامن وائس سی مے ڈیٹا سیٹ زید ہونیِن۔ کے یأ تأ تُنو پروفائل ڈیلیٹ کیو بھی تأ کامن وائس کے ریکارڈنگ سی ڈیلیٹ کؤ سی نہ بن بھانیِن۔

source: Your daily goal has been created
trw: چھی دی دی سی مقصد برابر کوا گأ

source: Your dataset is downloading!
trw: چھی ڈیٹا سیٹ ڈاؤنلوڈ ہویی!

source: Your download has started.
trw: چھی ڈانلوڈ مھیرے لیگیا ہُو

source: You’re contributing to a target segment
trw: تُو اے خاص حصّہ سی مدد کودُو

source: You’re contributing to our first target segment
trw: تُو مُھن آوّل ٹارگٹ سی کیا مدد کودُو

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
trw: آ کامن وائس سی بارا می، تنُو مقصدا سی بارا می آں دئی نم معلوماتا سی بارا می ایل میل حاصل کؤ نِمادُو۔

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
trw: مھیرے تُو برابر تُھو ایل میلا سی کیا، مقصدا سی یاد دہانی سی کیا آں تُنو کم سی تیریقی سی معلوم کؤ سی کیا آں کان وائس سی نیوز لیٹر سی کیا۔

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
trw: تُو چیر تیز تُھو۔ دھأک شیِش گھیِندے بُودا یرأ ہے جملہ ٹیک چھی۔

source: You're helping Common Voice reach our daily sentence goals!
trw: تُو کامن وائس سی روزانہ سی بنیاد تے ایسی کم سی پُورا کؤ می مدد کودُو

source: Your email address
trw: چھی ای میل ایڈریس

source: You respond or reply to it as naturally as you can
trw: تھو ایسی جواب دا کھیدیک قدرتی طریقا دے ہودُوو

source: Your files are being assembled. Please check again later.
trw: چھی فائل سرڑا بیَدی۔ بعد می بھی چیک کو۔

source: Your Languages
trw: چھی جیِب

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
trw: چھی جیِب سی قسم می ہوبھادُو کلپس لھأدتی! کو تھیے آسان تُھوا تُو تونُو سیٹنگ دأل جملا سی کیا بُو۔

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
trw: چھی جیِب سی ہے قسم ہوبھادُو جملا یے ما لھأت ! کو تھو یے غورا معلوم ہودُو تھو سیٹنگ بدل کیدے تُنُو جیِب می دأل جملہ بُو بھادی۔

source: Your username and email will not be associated with the published data.
trw: شائع کوئل ڈیٹا سیت چھی نام آں ای میل دئل نہ ہونیِن۔

source: Your weekly goal has been created
trw: چھی ہفتہ وار مقصد برابر کوا گأ

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
trw: دھأک ساعت می تأ اے ای میل پانیِن تی می کامن وائس زید چھی کاریل جیِب سی ایڈ کؤ سی طریقہ بنا بشنیِن

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
trw: تھویے کامن وائس سی ایسی ہر دی سی ریکارڈ کؤ می مدد کی!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
trw: تھو یے کان وائس سی ہر دی سی تصدیقی کم سی کؤ سی لھاسُو می مدد کی!

source: You've successfully signed up for contributing to { $language }. Thank you.
trw: تأ کامأبی دے مھید کم سی کؤ سی کیا سائن آپ کی { $language } ۔ چھی شکریہ

source: You want to join the Common Voice mailing list
trw: تُو کامن وائس سی ای میلا سی لسٹ می آمن میلادُو

source: You write down what you hear in the audio clips
trw: آڈیو می کا بُھویودُودا تیس لیِگ تُو

source: Zaza
trw: زارا

source: Zip #{ $offset } of { $total }
trw: زیِپ { $offset }{ $offset } ٹول

source: Zulu
trw: زُولُو

source: account recovery key
trw: کھاتا دُوآر جینی کؤ سی کُجی

source: add-on
trw: ایڈ آن

source: alternate text
trw: دیئی خط

source: attack
trw: دھار

source: attacker
trw: دھار دو

source: Attack Site
trw: دھار دیؤ سی سائٹ

source: attendee
trw: تیا/ میلأݜ

source: authenticate
trw: تصدیق کوا

source: authenticated
trw: تصدیق کویل

source: authentication code
trw: تصدیق سی نشان

source: autoplay
trw: أمنے چلُو

source: backup authentication code
trw: تصودیق سی کوڈ سی سنبھال کؤ

source: bookmark
trw: أنگی تھا

source: breakpoint
trw: پھورُو سی نخ

source: Bug report
trw: بگا سی رپورٹ

source: certificate authority
trw: تصدیق کؤ سی ادارہ

source: cipher
trw: پداکُو

source: clipboard
trw: کلپ بورڈ

source: colorway
trw: ڙانگ پن

source: confirmation code
trw: رأضی ہؤ سی نخ

source: context
trw: گیر چاپیر

source: cookie banner
trw: کوکی بینر

source: corrupt
trw: خزا پزا/کرپٹ

source: corrupted
trw: خزا ہویل/نشیل

source: crash
trw: پھورُو

source: cross-site tracking cookie
trw: کراس سائٹ معلوم کؤ سی کوکی

source: cryptominer
trw: کریپٹومینر

source: cryptomining
trw: کرپیٹومائننگ

source: debug
trw: کیمی پاک کؤ

source: deceptive site
trw: دھکا دیؤ سی سائٹ

source: decode
trw: کھولاؤ کؤ

source: decryption
trw: ڈی کریپشن

source: disinformation
trw: غلط معلومات

source: distrust
trw: نا یقنین

source: email mask
trw: ای میل ماسک

source: enable
trw: سوؤ/تیا کؤ

source: encode
trw: می یے ݜیؤ

source: encrypt
trw: اے پوت کؤ/این کریپٹ

source: encryption
trw: این کریپشن

source: end user
trw: فائیدہ گھیِن

source: Enhanced Tracking Protection
trw: لیا معلوم کؤ سی طریقہ چیری کؤ

source: extension
trw: گھینی کؤ

source: fingerprinter
trw: آنگیا سی نخ

source: fingerprinting
trw: أنگیا سی نخ کؤ

source: Firefox View
trw: فائر فاکس ویو

source: grassroots
trw: ٹوپ ما

source: home page
trw: ویب سائٹ سی اوّل سی مُو

source: import
trw: آندر کے آنُو

source: independent browser
trw: آزاد براؤزر

source: innovations
trw: نم کم

source: insecure
trw: سلامت نہ تُھو

source: installation
trw: اینسٹال کؤ

source: Issue
trw: مسلا

source: Legacy extension
trw: لیگیسی ایکسٹینشن

source: MDN
trw: این ڈی این

source: misinformation
trw: لوؤ ڈھو

source: native
trw: اصلی

source: net neutrality
trw: مساوی ہر ایک سی کیا

source: nonprofit
trw: بے منافع

source: non-profit
trw: بے منافع تنظیم

source: open source
trw: ہر ایک سی کیا آزاد مواد

source: override
trw: ڙید کے تھلُو

source: phone number mask
trw: فون نمبر سی ماسک

source: pop-up
trw: پاپ آپ

source: preference
trw: خوشوؤ

source: Privacy Notice
trw: پرایویٹ ہؤ سی اطلاع

source: release
trw: نھیِگالُو

source: report
trw: حال بنُو

source: restricted site
trw: گݜیل ویب سائٹ

source: revert
trw: پنکے یؤ/بیُو

source: Review checker
trw: جائزہ سی جائزہ گھیِن

source: search suggestion
trw: بھیِرڑُو سی صلا

source: security keys
trw: سیکیوریٹی کُنجی

source: sensitive
trw: خاص/ حساس

source: sidebar
trw: سآ/سائیڈ بار

source: sign
trw: دسخط

source: signer
trw: دسخطی

source: sign in
trw: ویب سائٹ کے لھنگُو

source: sign-in
trw: ویت سائٹ کے لھنگُو

source: studies
trw: جنؤ سی کیا بنُو سی مواد

source: Terms of Service
trw: شرائط

source: track
trw: بُو

source: trackers
trw: بُوآڑ

source: Tracking Content
trw: بُو سی مواد

source: unencrypted
trw: ان اینکریپٹڈ

source: unresponsive
trw: بے جوابا

source: unsafe
trw: نامحفوظ

source: validate
trw: تصدیق کؤ

source: validity
trw: ٹیک او سأز ہؤ

source: version
trw: وار/ورژن

source: Web Authentication
trw: ویب سی تصدیق کؤ
